[
  {
    "text": "My boyfriend (well just call him M) and I are creators on Instagram (he is also on TikTok). I'm a digital and traditional artist and in one of my classes we create t shirts and things (socks, lanyards, water bottles, stickers, you name it). I'm a big fan of putting my art on t shirts so I can sell them.\n\nM wanted to make some posts for TikTok and wanted to use the shirt I made today. My one personal rule is that if the shirt isn't being given to someone else, then I wear it first (this is because I know I wont get it back. Ive made one other shirt that I've worn, and he wore it for a week and hasn't given it back.) So I told him no, because I haven't worn the shirt yet. \n\nM proceeded to complain about not having content to post, and how his IG post today didn't get any engagement, saying \"of course you dont know, because you never look.\"\n\nAm I the asshole for wanting to wear the shirt I made just once?",
    "source": "scruples",
    "metadata": {
      "id": "ySQlJw4BNwbaNiHcdS6Hdf3ZHnBrAg9d",
      "title": "AITA for wanting to wear a shirt?",
      "post_id": "axdpn3",
      "subreddit": "",
      "site": "reddit"
    }
  },
  {
    "text": "Background: I have ocd and the only contamination issue I have is around food. Both parents know this. What has lead me to ask this question is this mornings reaction from parent B.\n\nThis morning parent b offered to make me breakfast, I responded how I always do: that’s very kind but I’m happy to come make it myself. Parent b said it was no trouble. I accepted. Two slices of toast came and apu I check the toast for signs of mould. First piece had no issues, I ate it. Second piece however had something green growing on the edge. I cut this bit off but I couldn’t shake in my head that the whole piece must be contaminated and so I took the toast back and apologised that I couldn’t eat it cos of the mould and we checked the date on the bread and it said the 30th December. Nearly a week past its best before. Parent b apologised and we threw it away. No drama.\n\nNearly identical situation occurred about 6 months ago with parent a. Parent a offered to make me a toasted sandwich. I said that would be very kind but I was happy to make it myself. Parent a said it was no problem, I accepted. When the sandwich came I checked the bread for mould and found green and white stuff growing down one side of the bread. I take it back to the kitchen and explain that it has mould and I’m sorry but I can’t eat it. I will make myself something else. Parent a goes ballistic. I’m “ungrateful and don’t trust them and did I really think they’d feed me mould?” I pointed out the mould- clearly visible. “Well someone must’ve not sealed the bread package properly (ie me) and that’s how it got mouldy.” I asked if parent a had checked the date and that just seemed to escalate their reaction. They stormed out screaming and crying. I checked the bread date and it was 2 or 3 days past the best before.\n\nAita in either situation? Parent a’s reaction made me think I was. But now I’ve had the same situation with parent b and they didn’t get angry or pissed off maybe I wasn’t the asshole? Obviously I think I need to just make my own food. Then I can’t cause trouble.",
    "source": "scruples",
    "metadata": {
      "id": "P96wm6qNDeGdaHy25VrNmYPWbtyTAxDN",
      "title": "Aita here? Two parents, two different reactions",
      "post_id": "actige",
      "subreddit": "",
      "site": "reddit"
    }
  },
  {
    "text": " \n\nMy really good friend is getting married. Yay!happy for her. I'm a bridesmaid in her wedding. Also yay. I am currently underemployed which my friend knows. I make about 35k (Canadian a year). I'm sensitive about this. I'm in a social work type field. \n\nOkay so friend lives a plane ride away. Approximately 600 bucks. Flights are pricey.  Anyway she hasn't decided yet but is thinking about a destination bacherlorette party...so it would be flight from Canada to that city, apparently a small gap of time then flight back to her wedding city but not enough so I can fly back home in between so it's looking like lots of unpaid leave. And it's just after Xmas next year so pricey time to fly.\n\nSince she got engaged she's been saying things along the lines of \"start saving for my bach party\" and \"we gotta save for the party\". I let her know these kinds of comments are super stressful for me as I have other savings goals and I'm doing my best to save for her thing too, but I am feeling unhappy financially.  She responded by basically saying she too has savings goals (her parent is paying for the whole wedding) and at least I'm not a homeless person like what happened to thousands of people in California. I just told her again i wanted to bring it up that telling me to save makes me feel stressed and anxious. She wrote it on the official bridesmaid invitation that I needed to save for her party and I mentioned how I didn't like that and she was like Oh so that's all your remember about my gift?! \n\nIt just runs me the wrong way and I think it's crazy tacky to tell people especially people struggling financially to save for your destination bacherlorette party. She thinks I'm overreacting and that I want to ban her from talking about her wedding. Its embarrassing enough to admit to financial struggles and she doesn't seem to get it. I just want her to tell me my presence and support are enough at her wedding.  Am I the asshole for saying what I said and for not prioritizing saving to be in her wedding party? ",
    "source": "scruples",
    "metadata": {
      "id": "QYwk7bbUf8VOiCDKRSoarulHfeZ3Rf6c",
      "title": "AITA for not wanting to be told to save money?",
      "post_id": "a0be1t",
      "subreddit": "",
      "site": "reddit"
    }
  }
]